robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2FOC-V3/src/2FOC.c
    Vq = 0;

    // current closed loop
    if (gControlMode == icubCanProto_controlmode_current || gControlMode == icubCanProto_controlmode_speed_current || sAlignInProgress)
    {
        int iQerror = IqRef-I2Tdata.IQMeasured;

        VqA += __builtin_mulss(iQerror-iQerror_old,IKp) + __builtin_mulss(iQerror+iQerror_old,IKi);

        iQerror_old = iQerror;

        if (VqA > IIntLimit) VqA = IIntLimit; else if (VqA < -IIntLimit) VqA = -IIntLimit;

        Vq = (int)((VqA+IKo)>>IKs);

        // alternative formulation with ff term
        //VqA += __builtin_mulss(iQerror+iQerror_old,Ki);
        //if (VqA > V_INT_LIMIT) VqA = V_INT_LIMIT; else if (VqA < -V_INT_LIMIT) VqA = -V_INT_LIMIT;
        //long VqF = VqA + __builtin_mulss(43,IqRef) + __builtin_mulss(93,gQEVelocity);
        //if (VqF > V_INT_LIMIT) VqF = V_INT_LIMIT; else if (VqF < -V_INT_LIMIT) VqF = -V_INT_LIMIT;
        //Vq = (int)(VqF>>Kshift);
    }
    else // current open loop
    {
#ifdef RELENTLESS
        if ((I2Tdata.IQMeasured > Iovr) || (I2Tdata.IQMeasured < -Iovr))
        {
            SysError.OverCurrentFailure = 1;
            // call fault handler
            FaultConditionsHandler();

            return;
        }   
#else
        if (I2Tdata.IQMeasured > Ipeak)
        {
            limit =  1;
        }
        else if (I2Tdata.IQMeasured < -Ipeak)
        {
            limit = -1;
        }

        if (limit)
        {
            if (limit == 1)
            {
                int iQerror =  Ipeak-I2Tdata.IQMeasured;
                VqL += __builtin_mulss(iQerror-iQerror_old,IKp) + __builtin_mulss(iQerror+iQerror_old,IKi);
                iQerror_old = iQerror;

                if (VqL >= 0) { VqL = 0; limit = 0; iQerror_old = 0; }
            }
            else if (limit == -1)
            {
                int iQerror = -Ipeak-I2Tdata.IQMeasured;
                VqL += __builtin_mulss(iQerror-iQerror_old,IKp) + __builtin_mulss(iQerror+iQerror_old,IKi);
                iQerror_old = iQerror;

                if (VqL <= 0) { VqL = 0; limit = 0; iQerror_old = 0; }
            }

            Vq = (int)((VqRef+VqL+IKo)>>IKs);
        }
        else
#endif // RELENTLESS
        {
            if (gControlMode == icubCanProto_controlmode_openloop)
            {
                Vq = (int)((VqRef+IKo)>>IKs);
            }
            else // if (gControlMode == icubCanProto_controlmode_speed_voltage)
            {
                Vq = (int)((VqRef+SKo)>>SKs);
            }
        }
    }
    //
    ////////////////////////////////////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////////////
    // BEMF section
    int iDerror = -I2Tdata.IDMeasured;

    VdA += __builtin_mulss(iDerror-iDerror_old,IKp) + __builtin_mulss(iDerror+iDerror_old,IKi);
    
    iDerror_old = iDerror;

    if (VdA > IIntLimit) VdA = IIntLimit; else if (VdA < -IIntLimit) VdA = -IIntLimit;
  
    int Vd = (int)((VdA+IKo)>>IKs);
    //
    ////////////////////////////////////////////////////////////////////////////


    ////////////////////////////////////////////////////////////////////////////
    // if we are close enough to the PCD register shadow copy then wait until
    // its done before updating local PDCs
    // The condition will became false when the PWM is counting down but it is 
    // still far from 0 or when it change direction counting up

    // reset the flag that indicates if the PWM registers update was delayed
    BOOL pwm_delayed = FALSE;

    // reset timeout counter that is used to wait for the PWM registers update
    int timeout = PWMSAFETIME;

    //     PWM count DN               PWM count < PWM_SAFE_TIME
    while ((P1TMR & 0x8000) && ((P1TMR & 0x7fff) < PWMSAFETIME))
    {
        pwm_delayed = TRUE;

        if (!--timeout)
        {
            SysError.FirmwarePWMFatalError = TRUE;
            FaultConditionsHandler();
            break;
        }
    }

    if (gSetpointWatchdog>0)
    {
        if (!--gSetpointWatchdog)
        {
            SysError.SetpointExpired = TRUE;
            FaultConditionsHandler();
        }
    }
    
    static long Vacc = 0;
    static long Iacc = 0;
    static char cntr = 0;
    static int Imax = 0x8000;
    static int Imin = 0x7FFF;
    
    if (I2Tdata.IQMeasured < Imin) Imin = I2Tdata.IQMeasured; 
    if (I2Tdata.IQMeasured > Imax) Imax = I2Tdata.IQMeasured;
    
    Vacc += Vq<<VOLT_REF_SHIFT;
    Iacc += I2Tdata.IQMeasured;
    
    if (++cntr == 40)
    {
        cntr = 0;
        
        Iacc -= Imin+Imax;
        
        IqFbk = __builtin_divsd(Iacc,38);
        VqFbk = __builtin_divsd(Vacc,40);
        
        Iacc = Vacc = 0;
        Imax = 0x8000;
        Imin = 0x7FFF;
    }
    //
    ////////////////////////////////////////////////////////////////////////////
    
    Vq/=2;
    Vd/=2;
    
    ////////////////////////////////////////////////////////////////////////////
    // inv transform and PWM drive    
    int V1 = (int)((__builtin_mulss(Vq,cosT)-__builtin_mulss(Vd*3,sinT)+0x7FFF)>>16);
    int V2 = (int)((__builtin_mulss(Vq,sinT)+__builtin_mulss(Vd  ,cosT)+0x7FFF)>>16);
    
    if (negative_sec) V2=-V2;

    *ppwmH =  V1-V2;
    *ppwm0 =  V2+V2;
    *ppwmL = -V1-V2;
    
    V1fbk = Va;
    V2fbk = Vb;
    V3fbk = Vc;
    
    pwmOut(Va,Vb,Vc);
    //
    ////////////////////////////////////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////////////
    // Invoke the I2T integrator with new current values

    if (!MotorConfig.has_tsens)
    {
        static int i2t_undersampler = 0;

        if (++i2t_undersampler >= 40)
        {
            i2t_undersampler = 0;

            I2Twatcher();
        }
    }

    //
    ////////////////////////////////////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////////////
    //Clear the DMA0 Interrupt Flag
    IFS0bits.DMA0IF = 0;
}

// When the 2foc loop is not running, the aux service timer
// (hw timer3) will avoid starving of I2T and Encoder services.
// I2T shall continue to discharge integrated data, and
// Encoder service shall mantain turn count in case of
// external torques rotates the axis.

